// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

// Задача 1. Напишите программу, которая принимает на вход число 
// и проверяет, кратно ли оно одновременно 7 и 23.
int n = 5278;
if (n % 7 == 0 & n % 23 == 0){
    Console.Write("Кратно");
}
else {Console.Write("Не кратно");
}

